# IsCustomized Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
TemporaryViewModes..::..IsCustomized Method
TemporaryViewModes Class See Also
---
Identifies if a custom temporary view mode is currently active. A custom mode is active if there is a non-empty string set for CustomTitle.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020.1
# Syntax
C#
---
```text
public bool IsCustomized()
```

Visual Basic
---
```text
Public Function IsCustomized As Boolean
```

Visual C++
---
```text
public:
bool IsCustomized()
```

# ### Return Value
Returns true a custom temporary view mode is currently active, false otherwise. A custom mode is active if there is a non-empty string set for CustomTitle.
# See Also
TemporaryViewModes Class
Autodesk.Revit.DB Namespace